FKDD_COPY_DIFF_3_2026-02-14/Catalogs/ВидыПлановКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыПлановКомпании</Name>
			<Comment>Виды планов компании</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.ВидыПлановКомпании</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодичностьПланирования</Name>
					<Comment>Периодичность заполнения и сверки плановых и фактических документов</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьАнализаНакопительныхСкидок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъектаПланирования</Name>
					<Comment>Используется для фильтрации состава аналитических объектов в обработках заполнения</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитическиеРазрезыПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАналитикиПланирования1</Name>
					<Comment>Тип первого аналитического реквизита таблицы план-фактных документов</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитическиеРазрезыПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАналитикиПланирования2</Name>
					<Comment>Тип второго аналитического реквизита таблицы план-фактных документов</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитическиеРазрезыПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательПлана1</Name>
					<Comment>Наименование первого числового показателя документов планирования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательПлана2</Name>
					<Comment>Наименование второго числового показателя документов планирования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательПлана3</Name>
					<Comment>Наименование третьего числового показателя документов планирования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыПлана</Name>
					<Comment>Список параметров плановых документов</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПараметра</Name>
							<Comment>Параметр планового документа</Comment>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначения</Name>
							<Comment>Тип значения параметра планового документа</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БазовыеПланы</Name>
					<Comment>Список видов планов, от которых зависит заполнение планов данного вида</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПлана</Name>
							<Comment>Вид плана, от которого зависит данный</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыПлановКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗависимости</Name>
							<Comment>По своему подразделению, по вложенным подразделениям, по родительскому подразделению</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗависимостейПланов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектПланированияПоАналитике</Name>
							<Comment>Объект планирования не связан с базовым по объекту планирования, или номер аналитики базового плана</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыборОбъектаПланированияПоАналитике</Name>
							<Comment>Объект планирования не связан с базовым по объекту планирования, или номер аналитики базового плана</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>70</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
					<Comment>Табличная часть, содержащая список подразделений</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Comment>Подразделение компании</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтсрочкаПлана</Name>
							<Comment>Количество дней отсрочки плана от начала периода планирования</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтсрочкаФакта</Name>
							<Comment>Количество дней отсрочки факта от конца периода планирования для расчета факта</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтчетыИОбработки</Name>
					<Comment>Перечень отчетов и обработок, связанных с данным объектом</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Comment>Наименование отчета / обработки для интерактивного выбора</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОбъекта</Name>
							<Comment>Переключатель типа и местонахождения объекта</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКОбъекту</Name>
							<Comment>Имя объекта метаданных или путь к файлу объекта</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФлагЗаполненияПлана</Name>
							<Comment>Признак наличия процедуры заполнения планового документа по установленным параметрам</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФлагПроверкиПлана</Name>
							<Comment>Признак наличия процедуры проверки планового документа по установленным параметрам</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФлагЗаполненияФакта</Name>
							<Comment>Признак наличия процедуры заполнения фактического документа по установленным параметрам</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыборВидаОбъекта</Name>
							<Comment>Переключатель типа и местонахождения объекта</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Catalogs/ВидыПлановКомпании/Ext/ManagerModule.bsl
// процедура заполнения предопределенных элементов справочника
//
// Параметры:
// ЗаполнятьВсе - Булево - Признак заполнение всей информации
//
Процедура ЗаполнитьПредопределенныеЭлементы(ЗаполнятьВсе=Ложь) Экспорт
	Макет = ПолучитьМакет("НастройкиПоУмолчанию");
	Если Макет = Неопределено Тогда
		Сообщить("Не обнаружен макет начальных настроек!");
		Возврат;
	КонецЕсли;
	Для НомерСтроки = 1 По Макет.ВысотаТаблицы Цикл
		// Считаем из макета Имя, Наименование, Код, Периодичность, ВидОбъектаПланирования,
		// ВидАналитикиПланирования1, ВидАналитикиПланирования2, ПоказательПлана1, ПоказательПлана2,
		// ПоказательПлана3, Параметры
		СтрИмя = СокрЛП(Макет.Область(НомерСтроки,1).Текст);
		СтрНаименование = СокрЛП(Макет.Область(НомерСтроки,2).Текст);
		СтрКод = СокрЛП(Макет.Область(НомерСтроки,3).Текст);
		СтрПериодичность = СокрЛП(Макет.Область(НомерСтроки,4).Текст);
		СтрВидОбъектаПланирования =	СокрЛП(Макет.Область(НомерСтроки,5).Текст);
		СтрВидАналитикиПланирования1 =	СокрЛП(Макет.Область(НомерСтроки,6).Текст);
		СтрВидАналитикиПланирования2 =	СокрЛП(Макет.Область(НомерСтроки,7).Текст);
		СтрПоказательПлана1 = СокрЛП(Макет.Область(НомерСтроки,8).Текст);
		СтрПоказательПлана2 = СокрЛП(Макет.Область(НомерСтроки,9).Текст);
		СтрПоказательПлана3 = СокрЛП(Макет.Область(НомерСтроки,10).Текст);
		СтрСсылкаОтчётыИОбработки = СокрЛП(Макет.Область(НомерСтроки,11).Текст);
		СтрСсылкаПараметрыПлана = СокрЛП(Макет.Область(НомерСтроки,12).Текст);
		СтрСсылкаБазовыеПланы = СокрЛП(Макет.Область(НомерСтроки,13).Текст);
		//получим элемент вида плана
		СсылкаВидПлана = Справочники.ВидыПлановКомпании[СтрИмя];
		Если СсылкаВидПлана.Пустая() Тогда
			Сообщить("Ошибка при заполнении вида плана: '" + СтрНаименование + "'. Указан отсутствующий элемент справочника виды планов!");
			Продолжить;
		Иначе
			ОбъектВидПлана = СсылкаВидПлана.ПолучитьОбъект();
		КонецЕсли;
		//будем искать с таким же наименованием
		Запрос = Новый Запрос("ВЫБРАТЬ
			|	ВидыПлановКомпании.Ссылка КАК ВидПлана
		    |ИЗ
		    |	Справочник.ВидыПлановКомпании КАК ВидыПлановКомпании
		    |
		    |ГДЕ
		    |	ВидыПлановКомпании.Наименование = &Наименование И
		    |	(ВидыПлановКомпании.ЭтоГруппа = ЛОЖЬ) И
		    |	(ВидыПлановКомпании.Предопределенный = ЛОЖЬ)");
		Запрос.УстановитьПараметр("Наименование",СтрНаименование);
		Выборка = Запрос.Выполнить().Выбрать();
		Номер = 1;
		//если с таким именем есть, будем заменять
		Пока Выборка.Следующий() Цикл
			//используем стандартную обработку
			ФормаЗаменаЗначений = Обработки.ПоискИЗаменаЗначений.ПолучитьФорму();
			ФормаЗаменаЗначений.Программно = Истина;
			СтрокаЗамены = ФормаЗаменаЗначений.ЗаменяемыеЗначения.Добавить();
			СтрокаЗамены.ЧтоЗаменять = Выборка.ВидПлана;
			СтрокаЗамены.НаЧтоЗаменять = СсылкаВидПлана;
			СтрокаЗамены.Пометка = Истина;
			ФормаЗаменаЗначений.Открыть();
			Сообщить("Справочник ""Виды планов компании"". Произведена замена ссылок на элемент """ + Выборка.ВидПлана + """ ссылками на элемент """ + СсылкаВидПлана + """");
			//
			ВидПлана = Выборка.ВидПлана.ПолучитьОбъект();
			ВидПлана.Наименование = СтрНаименование+"_" + Номер;
			ВидПлана.Записать();
			Номер = Номер + 1;
		КонецЦикла;
		//заполняем реквизиты
		Если ЗаполнятьВсе Тогда
			ОбъектВидПлана.Наименование = СтрНаименование;
		ИначеЕсли обЗначениеНеЗаполнено(ОбъектВидПлана.Наименование) Тогда
			ОбъектВидПлана.Наименование = СтрНаименование;
		КонецЕсли;	
		//Получим периодичность планирования
		Если НЕ обЗначениеНеЗаполнено(СтрПериодичность) Тогда
			СсылкаПериодичность = Перечисления.ПериодичностьАнализаНакопительныхСкидок[СтрПериодичность];
			Если СсылкаПериодичность.Пустая() Тогда
				Сообщить("Ошибка при заполнении периодичности планирования элемента: '" + СтрНаименование + "' Значение периодичности: '"+СтрПериодичность+"' не найдено");
			Иначе
				Если ЗаполнятьВсе Тогда
					ОбъектВидПлана.ПериодичностьПланирования = СсылкаПериодичность;
				ИначеЕсли обЗначениеНеЗаполнено(ОбъектВидПлана.ПериодичностьПланирования) Тогда
					ОбъектВидПлана.ПериодичностьПланирования = СсылкаПериодичность;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Сообщить("Ошибка при заполнении периодичности планирования элемента: '" + СтрНаименование + "' Значение периодичности: '"+СтрПериодичность+"' не найдено");
		КонецЕсли;
		
		//Получим Вид объекта планирования
		Если Не обЗначениеНеЗаполнено(СтрВидОбъектаПланирования) Тогда
			СсылкаАналитическиеРазрезыПланирования = ПланыВидовХарактеристик.АналитическиеРазрезыПланирования[СтрВидОбъектаПланирования];
			Если СсылкаАналитическиеРазрезыПланирования.Пустая() Тогда
				Сообщить("Ошибка при заполнении вида объекта планирования элемента: '" + СтрНаименование + "' Вид объекта планирования: '"+СтрВидОбъектаПланирования+"' не найден");
			Иначе
				Если ЗаполнятьВсе Тогда
					ОбъектВидПлана.ВидОбъектаПланирования = СсылкаАналитическиеРазрезыПланирования;
				ИначеЕсли обЗначениеНеЗаполнено(ОбъектВидПлана.ВидОбъектаПланирования) Тогда
					ОбъектВидПлана.ВидОбъектаПланирования = СсылкаАналитическиеРазрезыПланирования;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		//Получим Вид аналитики планирования1
		Если Не обЗначениеНеЗаполнено(СтрВидАналитикиПланирования1) Тогда
			СсылкаВидАналитикиПланирования1 = ПланыВидовХарактеристик.АналитическиеРазрезыПланирования[СтрВидАналитикиПланирования1];
			Если СсылкаВидАналитикиПланирования1.Пустая() Тогда
				Сообщить("Ошибка при заполнении вида аналитики планирования 1 элемента: '" + СтрНаименование + "' Вид аналитики планирования: '"+СтрВидАналитикиПланирования1+"' не найден");
			Иначе
				Если ЗаполнятьВсе Тогда
					ОбъектВидПлана.ВидАналитикиПланирования1 = СсылкаВидАналитикиПланирования1;
				ИначеЕсли обЗначениеНеЗаполнено(ОбъектВидПлана.ВидАналитикиПланирования1) Тогда	
					ОбъектВидПлана.ВидАналитикиПланирования1 = СсылкаВидАналитикиПланирования1;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Сообщить("Ошибка при заполнении вида аналитики планирования 1 элемента: '" + СтрНаименование + "' Вид аналитики планирования: '"+СтрВидАналитикиПланирования1+"' не указано");
		КонецЕсли;
		
		//Получим Вид аналитики планирования2
		Если НЕ обЗначениеНеЗаполнено(СтрВидАналитикиПланирования2) Тогда
			СсылкаВидАналитикиПланирования2 = ПланыВидовХарактеристик.АналитическиеРазрезыПланирования[СтрВидАналитикиПланирования2];
			Если СсылкаВидАналитикиПланирования2.Пустая() Тогда
				Сообщить("Ошибка при заполнении вида аналитики планирования 2 элемента: '" + СтрНаименование + "' Вид аналитики планирования: '"+СтрВидАналитикиПланирования2+"' не найден");
			Иначе
				Если ЗаполнятьВсе Тогда
					ОбъектВидПлана.ВидАналитикиПланирования2 = СсылкаВидАналитикиПланирования2;
				ИначеЕсли обЗначениеНеЗаполнено(ОбъектВидПлана.ВидАналитикиПланирования2) Тогда	
					ОбъектВидПлана.ВидАналитикиПланирования2 = СсылкаВидАналитикиПланирования2;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		//заполним показатели плана
		Если ЗаполнятьВсе Тогда
			ОбъектВидПлана.ПоказательПлана1 = СтрПоказательПлана1;
			ОбъектВидПлана.ПоказательПлана2 = СтрПоказательПлана2;
			ОбъектВидПлана.ПоказательПлана3 = СтрПоказательПлана3;
		Иначе
			Если (обЗначениеНеЗаполнено(ОбъектВидПлана.ПоказательПлана1) И (НЕ обЗначениеНеЗаполнено(СтрПоказательПлана1))) Тогда
				ОбъектВидПлана.ПоказательПлана1 = СтрПоказательПлана1;
			КонецЕсли;
			Если (обЗначениеНеЗаполнено(ОбъектВидПлана.ПоказательПлана2) И (НЕ обЗначениеНеЗаполнено(СтрПоказательПлана2))) Тогда	
				ОбъектВидПлана.ПоказательПлана2 = СтрПоказательПлана2;
			КонецЕсли;
			Если (обЗначениеНеЗаполнено(ОбъектВидПлана.ПоказательПлана3) И (НЕ обЗначениеНеЗаполнено(СтрПоказательПлана3))) Тогда	
				ОбъектВидПлана.ПоказательПлана3 = СтрПоказательПлана3;
			КонецЕсли;
		КонецЕсли;
		Если ЗаполнятьВсе Тогда
			ОбъектВидПлана.ПараметрыПлана.Очистить();
			ОбъектВидПлана.ОтчетыИОбработки.Очистить();
			ОбъектВидПлана.БазовыеПланы.Очистить();
		КонецЕсли;
		//Получим макет табличных частей
		МакетТабличнойЧасти = ПолучитьМакет("НастройкиПоУмолчаниюТабличныхЧастей");
		Если МакетТабличнойЧасти = Неопределено Тогда
			Сообщить("Не обнаружен макет начальных настроек!");
			Возврат;
		КонецЕсли;
		
		//Заполним табличную часть параметры плана
		Если НЕ обЗначениеНеЗаполнено(СтрСсылкаПараметрыПлана) Тогда
			ТабличнаяЧастьПараметрыПлана=ОбъектВидПлана.ПараметрыПлана;
			ОбластьМакета = МакетТабличнойЧасти.ПолучитьОбласть(СтрСсылкаПараметрыПлана);
			Для НомерСтрокиТабл = 1 По ОбластьМакета.ВысотаТаблицы Цикл
				СтрРеквизит1 = СокрЛП(ОбластьМакета.Область(НомерСтрокиТабл,1).Текст);
				ВидПараметра=ПланыВидовХарактеристик.ПараметрыПланирования[СтрРеквизит1];
				Если ВидПараметра.Пустая() Тогда
					Сообщить("Ошибка при заполнении таблицы параметров планирования: '" + СтрНаименование + "' параметр планирования: '"+СтрРеквизит1+"' не найден в ПВХ");
				КонецЕсли;
				ИмеющийсяВидПараметра=ОбъектВидПлана.ПараметрыПлана.Найти(ВидПараметра, "ВидПараметра"); 
				Если ИмеющийсяВидПараметра=Неопределено Тогда
					НоваяСтрока=ОбъектВидПлана.ПараметрыПлана.Добавить();
					НоваяСтрока.ВидПараметра=ВидПараметра;			
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	
		//Заполним табличную часть БазовыеПланы
		Если НЕ обЗначениеНеЗаполнено(СтрСсылкаБазовыеПланы) Тогда
			ТабличнаяЧастьБазовыеПланы=ОбъектВидПлана.БазовыеПланы;
			ОбластьМакета = МакетТабличнойЧасти.ПолучитьОбласть(СтрСсылкаБазовыеПланы);
			Для НомерСтрокиТабл = 1 По ОбластьМакета.ВысотаТаблицы Цикл
				СтрРеквизит1 = СокрЛП(ОбластьМакета.Область(НомерСтрокиТабл,1).Текст);
				СтрРеквизит2 = СокрЛП(ОбластьМакета.Область(НомерСтрокиТабл,2).Текст);
				СтрРеквизит3 = СокрЛП(ОбластьМакета.Область(НомерСтрокиТабл,3).Текст);
				//заполняем табличную часть
				СсылкаВидПлана = Справочники.ВидыПлановКомпании[СтрРеквизит1];
				Если СсылкаВидПлана.Пустая() Тогда
					Сообщить("Ошибка при заполнении вида плана элемента: '" + СтрНаименование + "' Вид плана: '"+СтрРеквизит1+"' не найден");
				Иначе
					СтрокаТабличнойЧастиБазовыеПланы = ТабличнаяЧастьБазовыеПланы.Найти(СсылкаВидПлана,"ВидПлана");
					Если СтрокаТабличнойЧастиБазовыеПланы = Неопределено Тогда
						СтрокаТабличнойЧастиБазовыеПланы = ТабличнаяЧастьБазовыеПланы.Добавить();
					КонецЕсли;
					Если ЗаполнятьВсе Тогда
						СтрокаТабличнойЧастиБазовыеПланы.ВидПлана=СсылкаВидПлана;
					ИначеЕсли обЗначениеНеЗаполнено(СтрокаТабличнойЧастиБазовыеПланы.ВидПлана) Тогда
						СтрокаТабличнойЧастиБазовыеПланы.ВидПлана=СсылкаВидПлана;
					КонецЕсли;
				КонецЕсли;
				Если ((ЗаполнятьВсе) ИЛИ (обЗначениеНеЗаполнено(СтрокаТабличнойЧастиБазовыеПланы.ВидЗависимости))) Тогда
					Если СтрРеквизит2="ПоСвоемуПодразделению" Тогда
						СтрокаТабличнойЧастиБазовыеПланы.ВидЗависимости=Перечисления.ВидыЗависимостейПланов.ПоСвоемуПодразделению;
					ИначеЕсли СтрРеквизит2="ПоВложеннымПодразделениям" Тогда
						СтрокаТабличнойЧастиБазовыеПланы.ВидЗависимости=Перечисления.ВидыЗависимостейПланов.ПоВложеннымПодразделениям;
					ИначеЕсли СтрРеквизит2="ПоРодительскомуПодразделению" Тогда
						СтрокаТабличнойЧастиБазовыеПланы.ВидЗависимости=Перечисления.ВидыЗависимостейПланов.ПоРодительскомуПодразделению;
					Иначе
						Сообщить("Ошибка при заполнении вида зависимости плана: '" + СтрНаименование + "' Вид зависимости плана: '"+СтрРеквизит2+"' не найден");
					КонецЕсли;
				КонецЕсли;
				Если ((ЗаполнятьВсе) ИЛИ (обЗначениеНеЗаполнено(СтрокаТабличнойЧастиБазовыеПланы.ОбъектПланированияПоАналитике))) Тогда
					Если СтрРеквизит3="0" Тогда
						СтрокаТабличнойЧастиБазовыеПланы.ВыборОбъектаПланированияПоАналитике=СтрРеквизит3;
						СтрокаТабличнойЧастиБазовыеПланы.ОбъектПланированияПоАналитике=1;
					ИначеЕсли СтрРеквизит3="1" Тогда
						СтрокаТабличнойЧастиБазовыеПланы.ВыборОбъектаПланированияПоАналитике=СтрРеквизит3;
						СтрокаТабличнойЧастиБазовыеПланы.ОбъектПланированияПоАналитике=2;
					ИначеЕсли СтрРеквизит3="2" Тогда
						СтрокаТабличнойЧастиБазовыеПланы.ВыборОбъектаПланированияПоАналитике=СтрРеквизит3;
						СтрокаТабличнойЧастиБазовыеПланы.ОбъектПланированияПоАналитике=3;
					Иначе
						Сообщить("Ошибка при заполнении объекта планирования: '" + СтрНаименование + "' Объект планирования: '"+СтрРеквизит3+"' не найден");
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		//Заполним табличную часть ОтчетыИОбработки
		Если НЕ обЗначениеНеЗаполнено(СтрСсылкаОтчётыИОбработки) Тогда
			ТабличнаяЧастьОтчётыИОбработки=ОбъектВидПлана.ОтчетыИОбработки;
			ОбластьМакета = МакетТабличнойЧасти.ПолучитьОбласть(СтрСсылкаОтчётыИОбработки);
			Для НомерСтрокиТабл = 1 По ОбластьМакета.ВысотаТаблицы Цикл
				СтрРеквизит1 = СокрЛП(ОбластьМакета.Область(НомерСтрокиТабл,1).Текст);
				СтрРеквизит2 = СокрЛП(ОбластьМакета.Область(НомерСтрокиТабл,2).Текст);
				СтрРеквизит3 = СокрЛП(ОбластьМакета.Область(НомерСтрокиТабл,3).Текст);
				СтрРеквизит4 = СокрЛП(ОбластьМакета.Область(НомерСтрокиТабл,4).Текст);
				СтрРеквизит5 = СокрЛП(ОбластьМакета.Область(НомерСтрокиТабл,5).Текст);
				СтрРеквизит6 = СокрЛП(ОбластьМакета.Область(НомерСтрокиТабл,6).Текст);
				//поищем в табличной части обработку с таким наименованием
				СтрокаТабличнойЧастиОтчётыИОбработки = ТабличнаяЧастьОтчётыИОбработки.Найти(СтрРеквизит6,);
				Если СтрокаТабличнойЧастиОтчётыИОбработки = Неопределено Тогда
					СтрокаТабличнойЧастиОтчётыИОбработки = ТабличнаяЧастьОтчётыИОбработки.Добавить();
				КонецЕсли;
				//заполняем табличную часть
				Если ЗаполнятьВсе Тогда
					Если СтрРеквизит1 = "встроенный запрос из текстового макета" Тогда
						СтрокаТабличнойЧастиОтчётыИОбработки.ВидОбъекта = 1;
					КонецЕсли;
					Если СтрРеквизит1 = "внешний запрос из текстового файла" Тогда
						СтрокаТабличнойЧастиОтчётыИОбработки.ВидОбъекта = 2;
					КонецЕсли;
					Если СтрРеквизит1 = "встроенная обработка" Тогда
						СтрокаТабличнойЧастиОтчётыИОбработки.ВидОбъекта = 3;
					КонецЕсли;
					Если СтрРеквизит1 = "внешняя обработка" Тогда
						СтрокаТабличнойЧастиОтчётыИОбработки.ВидОбъекта = 4;
					КонецЕсли;
					СтрокаТабличнойЧастиОтчётыИОбработки.ПутьКОбъекту = СтрРеквизит2;
					Если СтрРеквизит3 = "Истина" Тогда
						СтрокаТабличнойЧастиОтчётыИОбработки.ФлагЗаполненияПлана = Истина;
					Иначе
						СтрокаТабличнойЧастиОтчётыИОбработки.ФлагЗаполненияПлана = Ложь;
					КонецЕсли;
					Если СтрРеквизит4 = "Истина" Тогда
						СтрокаТабличнойЧастиОтчётыИОбработки.ФлагЗаполненияФакта = Истина;
					Иначе
						СтрокаТабличнойЧастиОтчётыИОбработки.ФлагЗаполненияФакта = Ложь;
					КонецЕсли;
					Если СтрРеквизит5 = "Истина" Тогда
						СтрокаТабличнойЧастиОтчётыИОбработки.ФлагПроверкиПлана = Истина;
					Иначе
						СтрокаТабличнойЧастиОтчётыИОбработки.ФлагПроверкиПлана = Ложь;
					КонецЕсли;
					СтрокаТабличнойЧастиОтчётыИОбработки.Наименование = СтрРеквизит6;
				Иначе
					Если обЗначениеНеЗаполнено(СтрокаТабличнойЧастиОтчётыИОбработки.ВидОбъекта) Тогда
						Если СтрРеквизит1 = "встроенный запрос из текстового макета" Тогда
							СтрокаТабличнойЧастиОтчётыИОбработки.ВидОбъекта = 1;
						КонецЕсли;
						Если СтрРеквизит1 = "внешний запрос из текстового файла" Тогда
							СтрокаТабличнойЧастиОтчётыИОбработки.ВидОбъекта = 2;
						КонецЕсли;
						Если СтрРеквизит1 = "встроенная обработка" Тогда
							СтрокаТабличнойЧастиОтчётыИОбработки.ВидОбъекта = 3;
						КонецЕсли;
						Если СтрРеквизит1 = "внешняя обработка" Тогда
							СтрокаТабличнойЧастиОтчётыИОбработки.ВидОбъекта = 4;
						КонецЕсли;
					КонецЕсли;
					Если ((СтрРеквизит3 = "Истина") И (СтрокаТабличнойЧастиОтчётыИОбработки.ФлагЗаполненияПлана = Ложь)) Тогда
						СтрокаТабличнойЧастиОтчётыИОбработки.ФлагЗаполненияПлана = Истина;
					ИначеЕсли ((СтрРеквизит3 = "Ложь") И (СтрокаТабличнойЧастиОтчётыИОбработки.ФлагЗаполненияПлана = Истина)) Тогда
						СтрокаТабличнойЧастиОтчётыИОбработки.ФлагЗаполненияПлана = Ложь;
					КонецЕсли;
					Если ((СтрРеквизит4 = "Истина") И (СтрокаТабличнойЧастиОтчётыИОбработки.ФлагЗаполненияФакта = Ложь)) Тогда
						СтрокаТабличнойЧастиОтчётыИОбработки.ФлагЗаполненияФакта = Истина;
					ИначеЕсли ((СтрРеквизит4 = "Ложь") И (СтрокаТабличнойЧастиОтчётыИОбработки.ФлагЗаполненияФакта = Истина)) Тогда
						СтрокаТабличнойЧастиОтчётыИОбработки.ФлагЗаполненияФакта = Ложь;
					КонецЕсли;
					Если ((СтрРеквизит5 = "Истина") И (СтрокаТабличнойЧастиОтчётыИОбработки.ФлагПроверкиПлана = Ложь)) Тогда
						СтрокаТабличнойЧастиОтчётыИОбработки.ФлагПроверкиПлана = Истина;
					ИначеЕсли ((СтрРеквизит5 = "Ложь") И (СтрокаТабличнойЧастиОтчётыИОбработки.ФлагПроверкиПлана = Истина)) Тогда
						СтрокаТабличнойЧастиОтчётыИОбработки.ФлагПроверкиПлана = Ложь;
					КонецЕсли;
					Если обЗначениеНеЗаполнено(СтрокаТабличнойЧастиОтчётыИОбработки.ПутьКОбъекту) Тогда
						СтрокаТабличнойЧастиОтчётыИОбработки.ПутьКОбъекту = СтрРеквизит2;
					КонецЕсли;
					Если обЗначениеНеЗаполнено(СтрокаТабличнойЧастиОтчётыИОбработки.Наименование) Тогда
						СтрокаТабличнойЧастиОтчётыИОбработки.Наименование = СтрРеквизит6;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		//Сохранение справочника
		НовыйЭлемент = ОбъектВидПлана.ЭтоНовый();
		Если ОбъектВидПлана.Модифицированность() Тогда
			Попытка		
				ОбъектВидПлана.Записать();
				Сообщить("Справочник ""Виды планов компании"". "+?(НовыйЭлемент,"Создан","Модифицирован")+" элемент """+СокрЛП(ОбъектВидПлана.Наименование)+"""");
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры // ЗаполнитьПредопределенныеЭлементы()
